
                                            **Task 3: Data Cleaning Day-2**

**#Install Pandas and numpy**

In [32]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

**#Load the CSV dataset**

In [19]:
import pandas as pd
df = pd.read_csv(r'C:\Users\Public\Downloads\sample_data.csv')
df

      Name   Age   Salary    JoinDate
0    Alice  25.0  50000.0  2020-01-15
1      Bob  30.0  60000.0  2019-06-01
2  Charlie  35.0      NaN  2021-03-20
3    David   NaN  70000.0  2020-11-11
4      Eve  45.0  80000.0  2018-07-23
5    Alice  25.0  50000.0  2020-01-15
6    Frank  40.0  75000.0  2019-09-10
7      NaN  22.0  48000.0  2022-01-01

**#Remove Missing Values**

In [20]:
# Drop rows with missing values


df_cleaned = df.dropna()


# Check result


print("After dropping missing values:", df_cleaned.shape)

After dropping missing values: (5, 4)

**# Convert Data Types**

In [43]:
import pandas as pd

df_cleaned.loc[:, 'Age'] = df_cleaned['Age'].astype(int)
df_cleaned.loc[:, 'JoinDate'] = pd.to_datetime(df_cleaned['JoinDate'])

# Check data types
print(df_cleaned.dtypes)

Name                object
Age                float64
Salary             float64
JoinDate    datetime64[ns]
dtype: object

**Normalize numeric columns (Age and Salary)**

In [44]:
from sklearn.preprocessing import MinMaxScaler

# Select numeric columns
numeric_cols = ['Age', 'Salary']

# Apply Min-Max Normalization safely
scaler = MinMaxScaler()
df_cleaned.loc[:, numeric_cols] = scaler.fit_transform(df_cleaned[numeric_cols])

In [45]:
df_cleaned[numeric_cols].head()

   Age    Salary
0  0.0  0.000000
1  0.0  0.333333
4  1.0  1.000000
5  0.0  0.000000
6  0.0  0.833333

**Save And Clean data**

In [61]:
cleaned_path = r'C:\Users\Dell\Downloads\cleaned_data.csv'
df_cleaned.to_csv(cleaned_path, index=False)

print('save successfuly')

save successfuly

**What i done**

Loaded raw data (sample_data.csv)

Removed missing and duplicate rows

Converted column types (Age to int, JoinDate to datetime)

Normalized numeric columns (Age, Salary)

Saved cleaned data to cleaned_data.csv